//================================================================================
//!	@file	 PlayerFactory.h
//!	@brief	 プレイヤー生成Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/23
//================================================================================
#ifndef	_PLAYER_FACTORY_H_
#define _PLAYER_FACTORY_H_



//****************************************
// インクルード文
//****************************************
#include "Player.h"
#include "PlayerUpdate.h"
#include "PlayerDraw.h"
#include "PlayerCollision.h"



//****************************************
// クラス宣言
//****************************************
class GameScene;



//************************************************************														   
//! @brief   プレイヤー生成Class
//!
//! @details プレイヤーの生成Class
//************************************************************
class PlayerFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief プレイヤー生成関数
	//! @details
	//! @param void なし
	//! @retval Player* プレイヤー
	//----------------------------------------
	Player* Create(GameScene* game_scene);
};



#endif