//================================================================================
//!	@file	 SkyDomeFactory.h
//!	@brief	 天球生成Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/22
//================================================================================
#ifndef	_SKY_DOME_FACTORY_H_
#define _SKY_DOME_FACTORY_H_



//****************************************
// インクルード文
//****************************************
#include "SkyDome.h"
#include "SkyDomeDraw.h"



//************************************************************														   
//! @brief   天球生成Class
//!
//! @details 天球の生成Class
//************************************************************
class SkyDomeFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 天球生成関数
	//! @details
	//! @param void なし
	//! @retval SkyDome* 天球
	//----------------------------------------
	SkyDome* Create();
};



#endif