//================================================================================
//!	@file	 Time.cpp
//!	@brief	 時間Class
//! @details 
//!	@author  Kai Araki									@date 2019/02/20
//================================================================================



//****************************************
// インクルード文
//****************************************
#include "../Time.h"



//****************************************
// プロパティ定義
//****************************************
int Time::getTime()
{
	return time_;
}



void Time::setTime(int value)
{
	time_ = value;
}



//****************************************
// 関数定義
//****************************************
void Time::Init(DrawBase* draw)
{
	time_ = 0;

	// 基底クラスの初期化
	setIsUpdate(false);
	GameObjectBase::Init(draw, nullptr);
}