//================================================================================
//!	@file	 FailureLogo.cpp
//!	@brief	 ¸”sƒƒSClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_FAILURE_LOGO_H_
#define _FAILURE_LOGO_H_



//****************************************
// ƒCƒ“ƒNƒ‹[ƒh•¶
//****************************************
#include <GameEngine/GameObject/GameObjectNull.h>



//************************************************************														   
//! @brief   ¸”sƒƒSClass
//!
//! @details ¸”sƒƒS‚ÌClass
//************************************************************
class FailureLogo : public GameObjectNull
{
//====================
// ŠÖ”
//====================
public:
	//----------------------------------------
	//! @brief ‰Šú‰»ŠÖ”
	//! @details
	//! @param *draw •`‰æŠî’êƒNƒ‰ƒX
	//! @retval void ‚È‚µ
	//----------------------------------------
	void Init(DrawBase* draw);
};



#endif