//================================================================================
//!	@file	 FailureLogoFactory.h
//!	@brief	 é∏îsÉçÉSê∂ê¨Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_FAILURE_LOGO_FACTORY_H_
#define _FAILURE_LOGO_FACTORY_H_



//****************************************
// ÉNÉâÉXêÈåæ
//****************************************
class FailureLogo;



//************************************************************														   
//! @brief   é∏îsÉçÉSê∂ê¨Class
//!
//! @details é∏îsÉçÉSÇÃê∂ê¨Class
//************************************************************
class FailureLogoFactory
{
//====================
// ä÷êî
//====================
public:
	//----------------------------------------
	//! @brief é∏îsÉçÉSê∂ê¨ä÷êî
	//! @details
	//! @param void Ç»Çµ
	//! @retval FailureLogo* é∏îsÉçÉS
	//----------------------------------------
	FailureLogo* Create();
};



#endif