//================================================================================
//!	@file	 CoinFactory.h
//!	@brief	 コイン生成Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_COIN_FACTORY_H_
#define _COIN_FACTORY_H_



//****************************************
// インクルード文
//****************************************
#include "Coin.h"
#include "CoinDraw.h"
#include "CoinCollision.h"



//************************************************************														   
//! @brief   コイン生成Class
//!
//! @details コインの生成Class
//************************************************************
class CoinFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コイン生成関数
	//! @details
	//! @param void なし
	//! @retval Coin* コイン
	//----------------------------------------
	Coin* Create();
};



#endif