//================================================================================
//!	@file	 QuadraticEquation.h
//!	@brief	 二次方程式Class
//! @details 
//!	@author  Kai Araki									@date 2017/12/12
//================================================================================
#ifndef	_QUADRATIC_EQUATION_H_
#define _QUADRATIC_EQUATION_H_



//****************************************
// インクルード文
//****************************************
#include "Vector3D.h"



//************************************************************														   
//! @brief   二次方程式Class
//!
//! @details 二次方程式のClass
//************************************************************
class QuadraticEquation
{
//====================
// 変数
//====================
private:
	float a_ = 0.0f;		//!< 項A
	float b_ = 0.0f;		//!< 項B
	float c_ = 0.0f;		//!< 項C
	float d_ = 0.0f;		//!< 項D
	float t0_ = 0.0f;
	float t1_ = 0.0f;

//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 項A取得関数
	//! @details
	//! @param void なし
	//! @retval float* 項A
	//----------------------------------------
	float* getpA();

	//----------------------------------------
	//! @brief 項B取得関数
	//! @details
	//! @param void なし
	//! @retval float* 項B
	//----------------------------------------
	float* getpB();

	//----------------------------------------
	//! @brief 項C取得関数
	//! @details
	//! @param void なし
	//! @retval float* 項C
	//----------------------------------------
	float* getpC();

	//----------------------------------------
	//! @brief 項D取得関数
	//! @details
	//! @param void なし
	//! @retval float* 項D
	//----------------------------------------
	float* getpD();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 項D作成関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void CreateD();

	//----------------------------------------
	//! @brief 解の公式計算関数
	//! @details
	//! @param void なし
	//! @retval bool 計算可能ならtrue
	//----------------------------------------
	bool CalculateTheSolutionFormula();
};



#endif