//================================================================================
//!	@file	 Score.cpp
//!	@brief	 スコアClass
//! @details 
//!	@author  Kai Araki									@date 2018/06/19
//================================================================================



//****************************************
// インクルード文
//****************************************
#include "../Score.h"



//****************************************
// プロパティ定義
//****************************************
GameScene* Score::getpGameScene()
{
	return game_scene_;
}



//****************************************
// 関数定義
//****************************************
void Score::Init(DrawBase* draw,
				 GameScene* game_scene)
{
	// 各種代入
	game_scene_ = game_scene;

	// 基底クラスの初期化
	setIsUpdate(false);
	GameObjectBase::Init(draw, nullptr);
}