//================================================================================
//!	@file	 Score.h
//!	@brief	 スコアClass
//! @details 
//!	@author  Kai Araki									@date 2018/06/19
//================================================================================
#ifndef	_SCORE_H_
#define _SCORE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/GameObject/GameObjectNull.h>



//************************************************************														   
//! @brief   スコアClass
//!
//! @details スコアのClass
//************************************************************
class Score : public GameObjectNull
{
//====================
// 変数
//====================
private:
	int score_ = 0;		//!< スコア


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief スコア取得関数
	//! @details
	//! @param void なし
	//! @retval int スコア
	//----------------------------------------
	int getScore();

	//----------------------------------------
	//! @brief スコア設定関数
	//! @details
	//! @param value スコア
	//! @retval void なし
	//----------------------------------------
	void setScore(int value);


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param *draw 描画基底クラス
	//! @retval void なし
	//----------------------------------------
	void Init(DrawBase* draw);
};



#endif