//================================================================================
//!	@file	 BalloonNumFactory.h
//!	@brief	 風船数生成Class
//! @details 
//!	@author  Kai Araki									@date 2019/02/20
//================================================================================
#ifndef	_BALLOON_NUM_FACTORY_H_
#define _BALLOON_NUM_FACTORY_H_



//****************************************
// インクルード文
//****************************************
#include "BalloonNum.h"
#include "BalloonNumDraw.h"



//************************************************************														   
//! @brief   風船数生成Class
//!
//! @details 風船数の生成Class
//************************************************************
class BalloonNumFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 風船数生成関数
	//! @details
	//! @param void なし
	//! @retval BalloonNum* 時間
	//----------------------------------------
	BalloonNum* Create();
};



#endif