//================================================================================
//!	@file	 TitleSceneState_Start.h
//!	@brief	 タイトルシーンステート(スタート)Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_TITLE_SCENE_STATE_START_H_
#define _TITLE_SCENE_STATE_START_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//****************************************
// クラス宣言
//****************************************
class TitleScene;




//************************************************************														   
//! @brief   タイトルシーンステート(スタート)Class
//!
//! @details タイトルシーンのステート(スタート)Class
//! @details 最初の状態を表す
//************************************************************
class TitleSceneState_Start : public SceneNull::StateNull
{
//====================
// 変数
//====================
private:
	TitleScene* title_scene_ = nullptr;		//!< タイトルシーン


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init() override;

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update() override;
};



#endif