//================================================================================
//!	@file	 GameScene.h
//!	@brief	 ゲームシーンClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_GAME_SCENE_H_
#define _GAME_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//****************************************
// クラス宣言
//****************************************
class StageManager;



//************************************************************														   
//! @brief   ゲームシーンClass
//!
//! @details ゲームシーンを管理するClass
//! @details ゲームシーン特有の共有データを持っている
//************************************************************
class GameScene : public SceneNull
{
//====================
// 変数
//====================
private:
	int time_;						//!< 時間
	StageManager* stage_manager_;	//!< ステージマネージャ


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 時間取得関数
	//! @details
	//! @param void なし
	//! @retval int 時間
	//----------------------------------------
	int getTime();

	//----------------------------------------
	//! @brief 時間設定関数
	//! @details
	//! @param value 時間
	//! @retval void なし
	//----------------------------------------
	void setTime(int value);

	//----------------------------------------
	//! @brief ステージマネージャ取得関数
	//! @details
	//! @param void なし
	//! @retval StageManager* ステージマネージャ
	//----------------------------------------
	StageManager* getpStageManager();

	//----------------------------------------
	//! @brief ステージマネージャ取得関数
	//! @details
	//! @param void なし
	//! @retval StageManager* ステージマネージャ
	//----------------------------------------
	void setStageManager(StageManager* value);


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *state 最初のステート
	//----------------------------------------
	GameScene(StateBase* state);

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init();
};



#endif