//================================================================================
//!	@file	 GameSceneState_Play.h
//!	@brief	 ゲームシーンステート(プレイ)Class
//! @details 
//!	@author  Kai Araki									@date 2019/02/18
//================================================================================
#ifndef	_GAME_SCENE_PLAY_START_H_
#define _GAME_SCENE_PLAY_START_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//****************************************
// クラス宣言
//****************************************
class GameScene;



//************************************************************														   
//! @brief   ゲームシーンステート(プレイ)Class
//!
//! @details ゲームシーンのステート(プレイ)Class
//! @details プレイの状態を表す
//************************************************************
class GameSceneState_Play : public SceneNull::StateNull
{
//====================
// 変数
//====================
private:
	GameScene* game_scene_ = nullptr;	//!< ゲームシーン


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init() override;

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update() override;
};



#endif