//================================================================================
//!	@file	 GameScene.h
//!	@brief	 ゲームシーンClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_GAME_SCENE_H_
#define _GAME_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//****************************************
// クラス宣言
//****************************************
class StageManager;
class Pause;



//************************************************************														   
//! @brief   ゲームシーンClass
//!
//! @details ゲームシーンを管理するClass
//! @details ゲームシーン特有の共有データを持っている
//************************************************************
class GameScene : public SceneNull
{
//====================
// 変数
//====================
public:
	enum class State
	{
		NONE = -1,
		START,
		GAME,
		PAUSE,
		END,
		MAX
	};


//====================
// 変数
//====================
private:
	int time_;							//!< 時間
	StageManager* stage_manager_;		//!< ステージマネージャ
	Pause* pause_;						//!< ポーズ


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 時間取得関数
	//! @details
	//! @param void なし
	//! @retval int 時間
	//----------------------------------------
	int getTime();

	//----------------------------------------
	//! @brief 時間設定関数
	//! @details
	//! @param value 時間
	//! @retval void なし
	//----------------------------------------
	void setTime(int value);

	//----------------------------------------
	//! @brief ステージマネージャ取得関数
	//! @details
	//! @param void なし
	//! @retval StageManager* ステージマネージャ
	//----------------------------------------
	StageManager* getpStageManager();

	//----------------------------------------
	//! @brief ステージマネージャ取得関数
	//! @details
	//! @param void なし
	//! @retval StageManager* ステージマネージャ
	//----------------------------------------
	void setStageManager(StageManager* value);


	//----------------------------------------
	//! @brief ポーズ取得関数
	//! @details
	//! @param void なし
	//! @retval Pause* ポーズ
	//----------------------------------------
	Pause* getpPause();

//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *value ステート
	//----------------------------------------
	GameScene(StateBase* state);

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init();

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update();
};



#endif