//================================================================================
//!	@file	 GameScene.h
//!	@brief	 ゲームシーンClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_GAME_SCENE_H_
#define _GAME_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//****************************************
// クラス宣言
//****************************************
class StageManager;



//************************************************************														   
//! @brief   ゲームシーンClass
//!
//! @details ゲームシーンを管理するClass
//! @details ゲームシーン特有の共有データを持っている
//************************************************************
class GameScene : public SceneNull
{
//====================
// 変数
//====================
private:
	bool is_clear_ = false;			//!< クリアフラグ
	int score_ = 0;					//!< スコア
	int game_over_ = -1;			//!< ゲームオーバーフラグ
	StageManager* stage_manager_;	//!< ステージマネージャ


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief クリアフラグ取得関数
	//! @details
	//! @param void なし
	//! @retval bool クリアの有無
	//----------------------------------------
	bool getIsClear();

	//----------------------------------------
	//! @brief クリアフラグ設定関数
	//! @details
	//! @param value クリアフラグ
	//! @retval void なし
	//----------------------------------------
	void setIsClear(bool value);
	
	//----------------------------------------
	//! @brief スコア取得関数
	//! @details
	//! @param void なし
	//! @retval int スコア値
	//----------------------------------------
	int getScore();

	//----------------------------------------
	//! @brief スコア設定関数
	//! @details
	//! @param value スコア値
	//! @retval void なし
	//----------------------------------------
	void setScore(int value);

	//----------------------------------------
	//! @brief ゲームオーバーフラグ取得関数
	//! @details
	//! @param void なし
	//! @retval bool ゲームオーバーの有無
	//----------------------------------------
	int getGameOver();

	//----------------------------------------
	//! @brief ゲームオーバーフラグ設定関数
	//! @details
	//! @param value ゲームオーバーフラグ
	//! @retval void なし
	//----------------------------------------
	void setGameOver(int value);

	//----------------------------------------
	//! @brief ステージマネージャ取得関数
	//! @details
	//! @param void なし
	//! @retval StageManager* ステージマネージャ
	//----------------------------------------
	StageManager* getpStageManager();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *state 最初のステート
	//----------------------------------------
	GameScene(StateBase* state);

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init();
};



#endif