//================================================================================
//!	@file	 StencilShadowTest.h
//!	@brief	 ステンシルシャドウテストClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_STENCIL_SHADOW_TEST_H_
#define _STENCIL_SHADOW_TEST_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/GameObject/GameObjectNull.h>



//************************************************************														   
//! @brief   ステンシルシャドウテストClass
//!
//! @details ステンシルシャドウテストのClass
//************************************************************
class StencilShadowTest : public GameObjectNull
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param *draw 描画基底クラス
	//! @retval void なし
	//----------------------------------------
	void Init(DrawBase* draw);
};



#endif