//================================================================================
//!	@file	 Pause.h
//!	@brief	 ポーズClass
//! @details 
//!	@author  Kai Araki									@date 2019/02/18
//================================================================================
#ifndef	_PAUSE_H_
#define _PAUSE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/GameObject/GameObjectNull.h>



//************************************************************														   
//! @brief   ポーズClass
//!
//! @details ポーズのClass
//************************************************************
class Pause : public GameObjectNull
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param *update 更新基底クラス
	//! @param *draw   描画基底クラス
	//! @retval void なし
	//----------------------------------------
	void Init(UpdateBase* update, DrawBase* draw);
};



#endif