//================================================================================
//!	@file	 ResultSceneState_Start.h
//!	@brief	 リザルトシーンステート(スタート)Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_RESULT_SCENE_STATE_START_H_
#define _RESULT_SCENE_STATE_START_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//****************************************
// クラス宣言
//****************************************
class ResultScene;



//************************************************************														   
//! @brief   リザルトシーンステート(スタート)Class
//!
//! @details リザルトシーンのステート(スタート)Class
//! @details 最初の状態を表す
//************************************************************
class ResultSceneState_Start : public SceneNull::StateNull
{
//====================
// 変数
//====================
private:
	ResultScene* result_scene_ = nullptr;	//!< リザルトシーン


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init() override;

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update() override;
};



#endif