//================================================================================
//!	@file	 ResultScene.h
//!	@brief	 リザルトシーンClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_RESULT_SCENE_H_
#define _RESULT_SCENE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Scene/SceneNull.h>



//************************************************************														   
//! @brief   リザルトシーンClass
//!
//! @details リザルトシーンを管理するClass
//! @details リザルトシーン特有の共有データを持っている
//************************************************************
class ResultScene : public SceneNull
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *state 最初のステート
	//----------------------------------------
	ResultScene(StateBase* state);

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init();

	//----------------------------------------
	//! @brief 終了関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Uninit();
};



#endif