//================================================================================
//!	@file	 TitleLogoFactory.h
//!	@brief	 タイトルロゴ生成Class
//! @details 
//!	@author  Kai Araki									@date 2018/06/19
//================================================================================
#ifndef	_TITLE_LOGO_FACTORY_H_
#define _TITLE_LOGO_FACTORY_H_



//****************************************
// クラス宣言
//****************************************
class TitleLogo;



//************************************************************														   
//! @brief   タイトルロゴ生成Class
//!
//! @details タイトルロゴの生成Class
//************************************************************
class TitleLogoFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief タイトルロゴ生成関数
	//! @details
	//! @param void なし
	//! @retval TitleLogo* タイトルロゴ
	//----------------------------------------
	TitleLogo* Create();
};



#endif