//================================================================================
//!	@file	 SceneBase.h
//!	@brief	 シーンBaseClass
//! @details 
//!	@author  Kai Araki									@date 2018/11/02
//================================================================================
#ifndef	_SCENE_BASE_H_
#define _SCENE_BASE_H_



//****************************************
// クラス宣言
//****************************************
class SceneManager;



//************************************************************														   
//! @brief   シーンBaseClass
//!
//! @details シーンのBaseClass
//************************************************************
class SceneBase
{
//====================
// クラス
//====================
public:
	//****************************************														   
	//! @brief   シーンステートBaseClass
	//!
	//! @details シーンステートのBaseClass
	//****************************************
	class StateBase
	{
	//====================
	// 変数
	//====================
	private:
		SceneBase* scene_ = nullptr;	//!< シーン
		int id_ = -1;					//!< ID


	//====================
	// プロパティ
	//====================
	public:
		//----------------------------------------
		//! @brief シーン取得関数
		//! @details
		//! @param void なし
		//! @retval SceneBase* シーン
		//----------------------------------------
		SceneBase* getpScene();

		//----------------------------------------
		//! @brief シーン設定関数
		//! @details
		//! @param *value シーン
		//! @retval void なし
		//----------------------------------------
		void setScene(SceneBase* value);

		//----------------------------------------
		//! @brief ID取得関数
		//! @details
		//! @param void なし
		//! @retval int ID
		//----------------------------------------
		int getID();

		//----------------------------------------
		//! @brief ID設定関数
		//! @details
		//! @param *value ID
		//! @retval void なし
		//----------------------------------------
		void setID(int value);


	//====================
	// 関数
	//====================
	public:
		//----------------------------------------
		//! @brief デストラクタ
		//! @details
		//! @param void なし
		//----------------------------------------
		virtual ~StateBase() = 0;

		//----------------------------------------
		//! @brief 初期化関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Init() = 0;

		//----------------------------------------
		//! @brief 終了関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Uninit() = 0;

		//----------------------------------------
		//! @brief 更新関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void Update() = 0;

		//----------------------------------------
		//! @brief ポーズ入口関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void PauseEntrance() = 0;

		//----------------------------------------
		//! @brief ポーズ出口関数
		//! @details
		//! @param void なし
		//! @retval void なし
		//----------------------------------------
		virtual void PauseExit() = 0;
	};


//====================
// 変数
//====================
private:
	SceneManager* scene_manager_ = nullptr;		//!< シーンマネージャ
	StateBase* state_ = nullptr;				//!< ステート
	int current_state_id_ = -1;					//!< 現在のステートID
	bool is_pause_ = false;						//!< ポーズフラグ


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief シーンマネージャ取得関数
	//! @details
	//! @param void なし
	//! @retval SceneManager* シーンマネージャ
	//----------------------------------------
	SceneManager* getpSceneManager();

	//----------------------------------------
	//! @brief シーンマネージャ設定関数
	//! @details
	//! @param *value シーンマネージャ
	//! @retval void なし
	//----------------------------------------
	void setSceneManager(SceneManager* value);

	//----------------------------------------
	//! @brief ステート取得関数
	//! @details
	//! @param void なし
	//! @retval StateBase* ステート
	//----------------------------------------
	StateBase* getpState();

	//----------------------------------------
	//! @brief ステート設定関数
	//! @details
	//! @param *value ステート
	//! @retval void なし
	//----------------------------------------
	void setState(StateBase* value);

	//----------------------------------------
	//! @brief リセット用ステート設定関数
	//! @details
	//! @param *value ステート
	//! @retval void なし
	//----------------------------------------
	void setResetState(StateBase* value);

	//----------------------------------------
	//! @brief ポーズフラグ取得関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	bool getIsPause();

	//----------------------------------------
	//! @brief ポーズフラグ設定関数
	//! @details
	//! @param value ポーズフラグ
	//! @retval void なし
	//----------------------------------------
	void setIsPause(bool value);

	//----------------------------------------
	//! @brief 現在のステートID取得関数
	//! @details
	//! @param void なし
	//! @retval int 現在のステートID
	//----------------------------------------
	int getCurrentStateID();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param *value ステート
	//----------------------------------------
	SceneBase(StateBase* state);

	//----------------------------------------
	//! @brief デストラクタ
	//! @details
	//! @param void なし
	//----------------------------------------
	virtual ~SceneBase() = 0;

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Init() = 0;

	//----------------------------------------
	//! @brief 終了関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Uninit() = 0;

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Update() = 0;

	//----------------------------------------
	//! @brief リセット関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	virtual void Reset() = 0;

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void InitState();

protected:
	//----------------------------------------
	//! @brief 終了関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void UninitState();

	//----------------------------------------
	//! @brief 更新関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void UpdateState();
};



#endif