//================================================================================
//!	@file	 OBB.h
//!	@brief	 OBBClass
//! @details 
//!	@author  Kai Araki									@date 2018/11/02
//================================================================================
#ifndef	_OBB_H_
#define _OBB_H_



//****************************************
// インクルード文
//****************************************
#include "CollisionShapeBase.h"

#include <Tool/Axis.h>
#include <Tool/Vector3D.h>



//************************************************************														   
//! @brief   OBBClass
//!
//! @details OBBのClass
//************************************************************
class OBB : public CollisionShapeBase
{
//====================
// 変数
//====================
private:
	Vector3D position_;		//!< 座標
	Vector3D length_;		//!< 各辺の長さ
	Axis axis_;				//!< 軸ベクトル
	Vector3D math_vector_;	//!< 計算用ベクトル


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 座標取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 座標
	//----------------------------------------
	Vector3D* getpPosition();

	//----------------------------------------
	//! @brief 各辺の取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 各辺の長さ
	//----------------------------------------
	Vector3D* getpLength();

	//----------------------------------------
	//! @brief 軸ベクトル取得関数
	//! @details
	//! @param void なし
	//! @retval Axis* 軸ベクトル
	//----------------------------------------
	Axis* getpAxis();

	//----------------------------------------
	//! @brief 右ベクトル取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D 右ベクトル
	//----------------------------------------
	Vector3D getRight();

	//----------------------------------------
	//! @brief 上ベクトル取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D 上ベクトル
	//----------------------------------------
	Vector3D getUp();

	//----------------------------------------
	//! @brief 前ベクトル取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D 前ベクトル
	//----------------------------------------
	Vector3D getForward();

	//----------------------------------------
	//! @brief 右ベクトルの半分取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D 右ベクトルの半分
	//----------------------------------------
	Vector3D getRightHalf();

	//----------------------------------------
	//! @brief 上ベクトルの半分取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D 上ベクトルの半分
	//----------------------------------------
	Vector3D getUpHalf();

	//----------------------------------------
	//! @brief 前ベクトルの半分取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D 前ベクトルの半分
	//----------------------------------------
	Vector3D getForwardHalf();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param void なし
	//----------------------------------------
	OBB();

	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param position 座標
	//! @param length   各辺の長さ
	//! @retval void なし
	//----------------------------------------
	void Init(Vector3D position, Vector3D length);
};



#endif