//================================================================================
//!	@file	 Triangle.h
//!	@brief	 三角形平面Class
//! @details 
//!	@author  Kai Araki									@date 2018/11/02
//================================================================================
#ifndef	_TRIANGLE_H_
#define _TRIANGLE_H_



//****************************************
// インクルード文
//****************************************
#include "CollisionShapeBase.h"
#include "Plane.h"

#include <Tool/Vector3D.h>



//************************************************************														   
//! @brief   三角形平面Class
//!
//! @details 三角形平面のClass
//************************************************************
class Triangle : public CollisionShapeBase
{
//====================
// 変数
//====================
private:
	Vector3D point0_;		//!< 点0
	Vector3D point1_;		//!< 点1
	Vector3D point2_;		//!< 点2
	Plane plane_;			//!< 平面


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 点0取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 点0
	//----------------------------------------
	Vector3D* getpPoint0();

	//----------------------------------------
	//! @brief 点1取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 点1
	//----------------------------------------
	Vector3D* getpPoint1();

	//----------------------------------------
	//! @brief 点2取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 点2
	//----------------------------------------
	Vector3D* getpPoint2();

	//----------------------------------------
	//! @brief 平面取得関数
	//! @details
	//! @param void なし
	//! @retval Vector3D* 平面
	//----------------------------------------
	Plane* getpPlane();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief コンストラクタ
	//! @details
	//! @param void なし
	//----------------------------------------
	Triangle();
	
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param point0 点0
	//! @param point1 点1
	//! @param point2 点2
	//! @retval void なし
	//----------------------------------------
	void Init(Vec3 point0, Vec3 point1, Vec3 point2);
};



#endif