//================================================================================
//!	@file	 TutorialLogoFactory.h
//!	@brief	 チュートリアルロゴ生成Class
//! @details 
//!	@author  Kai Araki									@date 2018/09/02
//================================================================================
#ifndef	_TUTORIAL_LOGO_FACTORY_H_
#define _TUTORIAL_LOGO_FACTORY_H_



//****************************************
// クラス宣言
//****************************************
class TutorialLogo;



//************************************************************														   
//! @brief   チュートリアルロゴ生成Class
//!
//! @details チュートリアルロゴの生成Class
//************************************************************
class TutorialLogoFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief チュートリアルロゴ生成関数
	//! @details
	//! @param void なし
	//! @retval TutorialLogo* チュートリアルロゴ
	//----------------------------------------
	TutorialLogo* Create();
};



#endif