//================================================================================
//!	@file	 TitleLogo.cpp
//!	@brief	 タイトルロゴClass
//! @details 
//!	@author  Kai Araki									@date 2018/07/03
//================================================================================



//****************************************
// インクルード文
//****************************************
#include "../TitleLogo.h"



//****************************************
// 関数定義
//****************************************
void TitleLogo::Init(DrawBase* draw)
{
	// 基底クラスの初期化
	setIsUpdate(false);
	GameObjectBase::Init(draw, nullptr);
}