//================================================================================
//!	@file	 Time.h
//!	@brief	 時間Class
//! @details 
//!	@author  Kai Araki									@date 2019/02/20
//================================================================================
#ifndef	_TIME_H_
#define _TIME_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/GameObject/GameObjectNull.h>



//************************************************************														   
//! @brief   時間Class
//!
//! @details 時間のClass
//************************************************************
class Time : public GameObjectNull
{
//====================
// 変数
//====================
private:
	int time_ = 0;		//!< 時間


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 時間取得関数
	//! @details
	//! @param void なし
	//! @retval int 時間
	//----------------------------------------
	int getTime();

	//----------------------------------------
	//! @brief 時間設定関数
	//! @details
	//! @param value 時間
	//! @retval void なし
	//----------------------------------------
	void setTime(int value);


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param *draw 描画基底クラス
	//! @retval void なし
	//----------------------------------------
	void Init(DrawBase* draw);
};



#endif