//================================================================================
//!	@file	 PushSpaceLogo.h
//!	@brief	 プッシュスペースロゴClass
//! @details 
//!	@author  Kai Araki									@date 2018/09/02
//================================================================================
#ifndef	_PUSH_SPACE_LOGO_H_
#define _PUSH_SPACE_LOGO_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/GameObject/GameObjectNull.h>



//************************************************************														   
//! @brief   プッシュスペースロゴClass
//!
//! @details プッシュスペースロゴのClass
//************************************************************
class PushSpaceLogo : public GameObjectNull
{
//====================
// 変数
//====================
private:
	XColor4 color_ = {1.0f, 1.0f, 1.0f, 1.0f};		//!< 色
	bool is_color_change_ = false;					//!< 色変更フラグ


//====================
// プロパティ
//====================
public:
	//----------------------------------------
	//! @brief 色取得関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	XColor4* getpColor();

	//----------------------------------------
	//! @brief 色変更フラグ取得関数
	//! @details
	//! @param void なし
	//! @retval bool 色変更フラグ
	//----------------------------------------
	bool* getpIsColorChange();


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param *update 更新基底クラス
	//! @param *draw   描画基底クラス
	//! @retval void なし
	//----------------------------------------
	void Init(UpdateBase* update, DrawBase* draw);

	//----------------------------------------
	//! @brief リセット関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Reset() override;
};



#endif