//================================================================================
//!	@file	 PushSpaceLogoUpdate.h
//!	@brief	 プッシュスペースロゴ更新Class
//! @details 
//!	@author  Kai Araki									@date 2018/09/02
//================================================================================
#ifndef	_PUSH_SPACE_LOGO_UPDATE_H_
#define _PUSH_SPACE_LOGO_UPDATE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Update/UpdateNull.h>



//****************************************
// クラス宣言
//****************************************
class PushSpaceLogo;



//************************************************************														   
//! @brief   プッシュスペースロゴ更新Class
//!
//! @details プッシュスペースロゴの更新Class
//************************************************************
class PushSpaceLogoUpdate : public UpdateNull
{
//====================
// 定数
//====================
private:
	static const int COLOR_CHANGE_SPEED;		//!< 色変更速度


//====================
// 変数
//====================
private:
	PushSpaceLogo* push_space_logo_;	//!< プッシュスペースロゴ
	int color_change_counter_;			//!< 色変更カウンタ
	

//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init() override;

	//----------------------------------------
	//! @brief 更新関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update() override;

	//----------------------------------------
	//! @brief リセット関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Reset() override;
};



#endif