//================================================================================
//!	@file	 BalloonUpdate.h
//!	@brief	 風船更新Class
//! @details 
//!	@author  Kai Araki									@date 2019/02/05
//================================================================================
#ifndef	_BALLOON_UPDATE_H_
#define _BALLOON_UPDATE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Update/UpdateNull.h>



//****************************************
// クラス宣言
//****************************************
class Balloon;



//************************************************************														   
//! @brief   風船更新Class
//!
//! @details 風船の更新Class
//************************************************************
class BalloonUpdate : public UpdateNull
{
//====================
// 変数
//====================
private:
	static const float SPEED;		//!< 速度


//====================
// 変数
//====================
private:
	Balloon* balloon_;	//!< 風船
	float acc_z = 0.0f;


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init() override;

	//----------------------------------------
	//! @brief 更新関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update() override;
};



#endif