//================================================================================
//!	@file	 PixelShaderShadowMap.h
//!	@brief	 シャドウマップピクセルシェーダーClass
//! @details 
//!	@author  Kai Araki									@date 2019/02/20
//================================================================================
#ifndef	_PIXEL_SHADER_SHADOW_MAP_H_
#define _PIXEL_SHADER_SHADOW_MAP_H_



//****************************************
// インクルード文
//****************************************
#include "PixelShaderNull.h"

#include <Tool/Vector3D.h>



//************************************************************														   
//! @brief   シャドウマップピクセルシェーダーClass
//!
//! @details シャドウマップのピクセルシェーダーClass
//************************************************************
class PixelShaderShadowMap : public PixelShaderNull
{
//====================
// 定数
//====================
private:
	static const char* PATH;			//!< ファイルパス
	

//====================
// 変数
//====================
private:
	

//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init();

	//----------------------------------------
	//! @brief 終了関数
	//! @details
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Uninit();
};



#endif
