//================================================================================
//!	@file	 SkyDomeFactory.cpp
//!	@brief	 天球生成Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/22
//================================================================================



//****************************************
// インクルード文
//****************************************
#include "../SkyDomeFactory.h"



//****************************************
// 関数定義
//****************************************
SkyDome* SkyDomeFactory::Create()
{
	SkyDome* temp = new SkyDome();
	temp->Init(new SkyDomeDraw());
	return temp;
}