//================================================================================
//!	@file	 Enemy.cpp
//!	@brief	 敵Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================



//****************************************
// インクルード文
//****************************************
#include "../Enemy.h"



//****************************************
// 定数定義
//****************************************
const float Enemy::SPEED = 0.1f;



//****************************************
// 関数定義
//****************************************
void Enemy::Init(DrawBase* draw, CollisionBase* collision)
{
	*getpTransform()->getpScale() = Vec3(3.0f, 3.0f, 3.0f);
	
	// 基底クラスの初期化
	GameObjectBase::Init(draw, collision);
}



void Enemy::Update()
{
}