//================================================================================
//!	@file	 EnemyFactory.h
//!	@brief	 ìGê∂ê¨Class
//! @details 
//!	@author  Kai Araki									@date 2018/07/24
//================================================================================
#ifndef	_ENEMY_FACTORY_H_
#define _ENEMY_FACTORY_H_



//****************************************
// ÉCÉìÉNÉãÅ[Éhï∂
//****************************************
#include "Enemy.h"
#include "EnemyUpdate.h"
#include "EnemyDraw.h"
#include "EnemyCollision.h"



//************************************************************														   
//! @brief   ìGê∂ê¨Class
//!
//! @details ìGÇÃê∂ê¨Class
//************************************************************
class EnemyFactory
{
//====================
// ä÷êî
//====================
public:
	//----------------------------------------
	//! @brief ìGê∂ê¨ä÷êî
	//! @details
	//! @param void Ç»Çµ
	//! @retval Enemy* ìG
	//----------------------------------------
	Enemy* Create();
};



#endif