//================================================================================
//!	@file	 EnemyUpdate.h
//!	@brief	 敵更新Class
//! @details 
//!	@author  Kai Araki									@date 2019/07/24
//================================================================================
#ifndef	_ENEMY_UPDATE_H_
#define _ENEMY_UPDATE_H_



//****************************************
// インクルード文
//****************************************
#include <GameEngine/Update/UpdateNull.h>



//****************************************
// クラス宣言
//****************************************
class Enemy;



//************************************************************														   
//! @brief   敵更新Class
//!
//! @details 敵の更新Class
//************************************************************
class EnemyUpdate : public UpdateNull
{
//====================
// 定数
//====================
private:
	static const float SPEED;		//!< 速度

//====================
// 変数
//====================
private:
	Enemy* enemy_;	//!< 敵


//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief 初期化関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Init() override;

	//----------------------------------------
	//! @brief 更新関数
	//! @details 
	//! @param void なし
	//! @retval void なし
	//----------------------------------------
	void Update() override;
};



#endif