//================================================================================
//!	@file	 StartBlockFactory.h
//!	@brief	 スタートブロック生成Class
//! @details 
//!	@author  Kai Araki									@date 2019/02/20
//================================================================================
#ifndef	_START_BLOCK_FACTORY_H_
#define _START_BLOCK_FACTORY_H_



//****************************************
// インクルード文
//****************************************
#include "StartBlock.h"
#include "StartBlockDraw.h"
#include "StartBlockCollision.h"



//************************************************************														   
//! @brief   スタートブロック生成Class
//!
//! @details スタートブロックの生成Class
//************************************************************
class StartBlockFactory
{
//====================
// 関数
//====================
public:
	//----------------------------------------
	//! @brief スタートブロック生成関数
	//! @details
	//! @param void なし
	//! @retval StartBlock* スタートブロック
	//----------------------------------------
	StartBlock* Create();
};



#endif